AUTO_config_TK_pesok/src/DataProcessors/ТК_ЗагрузкаЗаказов/ТК_ЗагрузкаЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТК_ЗагрузкаЗаказов</name>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_УчетХарактеристикНаСкладах/ТК_УчетХарактеристикНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_УчетХарактеристикНаСкладах</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НеВестиУчетПоХарактеристикам</name>
    <comment>Не вести учет по характеристикам на данном складе</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_УчетнаяПолитикаТорговыхПлощадок/ТК_УчетнаяПолитикаТорговыхПлощадок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_УчетнаяПолитикаТорговыхПлощадок</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <comment>Заказ покупателя</comment>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <registerRecords>AccumulationRegister.ОбработкаЗаказовПоставщику</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПокупателей</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Поставщик/комитент от которого мы получили товар</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорВзаиморасчетов</name>
    <comment>Договор по которому ведутся взаиморасчеты с контрагентом</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>Курс валюты документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <comment>Срок отгрузки товаров по заказу контрагенту</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегламентированныйУчет</name>
    <comment>Флаг отражения документа в регламентированном учете</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаДоставки</name>
    <comment>Адрес доставки для использования в печатных формах (оставлен для совместимости)</comment>
    <type>
      <types>CatalogRef.ТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксироватьЦены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПробивкаБезОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GuidСистемыСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКомментарий</name>
    <comment>Произвольный дополнительный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортативноеУстройствоВвода</name>
    <type>
      <types>CatalogRef.ПортативныеУстройстваВвода</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоРедактирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДДокументаОтгрузки</name>
    <comment>ID документа отгрузки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакОсновногоЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадкаПолучатель</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <comment>Сотрудник, заключивший сделку с контрагентом</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервироватьВОсновныхЕдиницах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Таблица товаров и услуг</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Единица измерения номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика/серия номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество единиц измерения номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБазовое</name>
      <comment>Количество номенклатуры в базовых единицах (коэффициент=1)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНалогов</name>
      <comment>Цена без налогов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <comment>Итоговая сумма по строке документа со всеми налогами</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС по номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС по номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНалогов</name>
      <comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <comment>Процент скидки на продаваемый товар</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <comment>Сумма скидки по строке документа</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеЗаказовПоставщиков</name>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/DataProcessors/ТК_ЗагрузкаЗаказов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс


Функция СформироватьДокументы(Знач ДеревоДокументов, Знач ДопПараметры) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Организация = ДопПараметры.Организация;
	
	Автор = Пользователи.ТекущийПользователь();
	ВалютаДокумента = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СкладыКомпании.Ссылка КАК СкладКомпании,
	               |	СкладыКомпании.Подразделение КАК Подразделение,
	               |	СкладыКомпании.ТипЦенСебестоимости КАК ТипЦен,
	               |	ЕСТЬNULL(ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	               |	СкладыКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка,
	               |	ЕСТЬNULL(ТК_УчетХарактеристикНаСкладахСрезПоследних.НеВестиУчетПоХарактеристикам, ЛОЖЬ) КАК НеВестиУчетПоХарактеристикам
	               |ИЗ
	               |	РегистрСведений.ТК_УчетХарактеристикНаСкладах.СрезПоследних КАК ТК_УчетХарактеристикНаСкладахСрезПоследних,
	               |	Справочник.СкладыКомпании КАК СкладыКомпании
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(, ТорговаяПлощадка = ВЫРАЗИТЬ(&Ссылка КАК Справочник.СкладыКомпании).ТорговаяПлощадка) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
	               |		ПО СкладыКомпании.ТорговаяПлощадка = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
	               |ГДЕ
	               |	СкладыКомпании.Ссылка = &Ссылка";
	
	Результат = Новый Структура;
	
	Ит = 0;
	Для Каждого СтрокаДереваДокумент Из ДеревоДокументов.Строки Цикл 
		Ит = Ит + 1;
		
		Если СтрокаДереваДокумент.Выбор = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДопПараметры.СкладКомпании.Подразделение <> СтрокаДереваДокумент.ДоговорПокупателя.Подразделение Тогда
			ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Подразделение склада %1 не соответствует подразделению договора. Пропускаем...'; uk = 'Підрозділ %1 складу %1 не відповідає підрозділу договору. Пропускаємо...'"),
			ДопПараметры.СкладКомпании));					
			Продолжить;
		КонецЕсли;
		
		ДокументЗаказОбъект = Документы.ЗаказПокупателя.СоздатьДокумент();
		
		СкладКомпании = ДопПараметры.СкладКомпании;

		Запрос.УстановитьПараметр("Ссылка", СкладКомпании);
		РеквизитыСклада = Новый Структура("Подразделение, ТипЦен, Организация, ТорговаяПлощадка, НеВестиУчетПоХарактеристикам",
									ПредопределенноеЗначение("Справочник.ПодразделенияКомпании.ПустаяСсылка"),
									ПредопределенноеЗначение("Справочник.ТипыЦен.ПустаяСсылка"),
									ПредопределенноеЗначение("Справочник.ТорговыеПлощадки.ПустаяСсылка"),
									Ложь);
	
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			ЗаполнитьЗначенияСвойств(РеквизитыСклада, Выборка);		
		КонецЕсли;

		ДокументЗаказОбъект.РегламентированныйУчет = Истина;
		
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		ДокументЗаказОбъект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ЗаказПокупателя");
		ДокументЗаказОбъект.Организация = Организация;
		ДокументЗаказОбъект.Автор = Автор;
		ДокументЗаказОбъект.ПодразделениеКомпании = РеквизитыСклада.Подразделение;		
		ДокументЗаказОбъект.ТорговаяПлощадка = РеквизитыСклада.ТорговаяПлощадка;
		ДокументЗаказОбъект.СкладКомпании = СкладКомпании;
		ДокументЗаказОбъект.ТипЦен = РеквизитыСклада.ТипЦен;
		ДокументЗаказОбъект.ВалютаДокумента = ВалютаДокумента;
		ДокументЗаказОбъект.КурсДокумента = 1;
				
		ДокументЗаказОбъект.Дата = ТекущаяДата();
		ДокументЗаказОбъект.УстановитьНовыйНомер();
		
		ДокументЗаказОбъект.Контрагент = СтрокаДереваДокумент.Контрагент;
		ДокументЗаказОбъект.ДоговорВзаиморасчетов = СтрокаДереваДокумент.ДоговорПокупателя;
		ДокументЗаказОбъект.ТочкаДоставки= СтрокаДереваДокумент.ТочкаДоставки;
		
		Для Каждого СтрокаТовары Из СтрокаДереваДокумент.Строки Цикл 
			НоваяСтрокаТовары = ДокументЗаказОбъект.Товары.Добавить();
			
			НоваяСтрокаТовары.Номенклатура = СтрокаТовары.ДокументНоменклатура;			
			НоваяСтрокаТовары.ХарактеристикаНоменклатуры =  Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			Количество = СтрокаТовары.Количество*НоваяСтрокаТовары.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент;
			НоваяСтрокаТовары.Количество =   Количество;
			НоваяСтрокаТовары.КоличествоБазовое =   Количество;
		КонецЦикла;
		
		тзТоварыДокумента = ДокументЗаказОбъект.Товары.Выгрузить();
		
		Кэш = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
		
		СтруктураПолейДляЗаполненияЦен = Новый Структура;	
		СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(ДокументЗаказОбъект,,ТекущаяДата()));
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);	
		СтруктураДействий.Вставить("ЦеныБезХарактеристики",Истина);
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре",Новый Структура("Контрагент,Организация,ТорговаяПлощадка,ТипСтавкиНДС",ДокументЗаказОбъект.Контрагент,ДокументЗаказОбъект.Организация,ДокументЗаказОбъект.ТорговаяПлощадка,"Реализация"));
		СтруктураДействий.Вставить("ПересчитатьЦенуСНДС");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
		СтруктураДействий.Вставить("ПересчитатьСуммуВсего");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));	

		Для Каждого ТекущаяСтрока Из тзТоварыДокумента Цикл 
			СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", ТекущаяСтрока.ЕдиницаИзмерения);
		    ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Кэш);					
		КонецЦикла;			
		
		Разделить = Ложь;
		КопияСтавка = тзТоварыДокумента.Скопировать();
		КопияСтавка.Свернуть("СтавкаНДС");
		Если КопияСтавка.Количество() > 1 Тогда
			Разделить = Истина;
		КонецЕсли;
		
		Если Разделить 	Тогда 
			НайденыеСтроки = тзТоварыДокумента.НайтиСтроки(Новый Структура("СтавкаНДС", Справочники.СтавкиНДС.БезНДС));
			тзБезНДС  = тзТоварыДокумента.Скопировать(НайденыеСтроки);
			Для Каждого стр из НайденыеСтроки Цикл
				тзТоварыДокумента.Удалить(стр);
			КонецЦикла;
			
			ДокументЗаказОбъект.Товары.Загрузить(тзТоварыДокумента);
			
			Попытка
				Если ДокументЗаказОбъект.ПроверитьЗаполнение() Тогда 
					ДокументЗаказОбъект.Записать();
				Иначе
					ДокументЗаказОбъект.Записать();
					
					ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Документ %1 не проведен'; uk = 'Документ %1 не проведений'"),
					ДокументЗаказОбъект.Ссылка),
					ДокументЗаказОбъект.Ссылка);
				КонецЕсли;
			Исключение                                                                  
				ДокументЗаказОбъект.Записать();
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
			
			ДокКопия = ДокументЗаказОбъект.Скопировать();
			ДокКопия.УстановитьНовыйНомер();
			ДокКопия.Товары.Очистить();
			ДокКопия.Товары.Загрузить(тзБезНДС);
			Попытка
				Если ДокКопия.ПроверитьЗаполнение() Тогда 
					ДокКопия.Записать();
				Иначе
					ДокКопия.Записать();
					
					ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Документ %1 не проведен'; uk = 'Документ %1 не проведений'"),
					ДокКопия.Ссылка),
					ДокКопия.Ссылка);
				КонецЕсли;
			Исключение                                                                  
				ДокКопия.Записать();
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		Иначе
			ДокументЗаказОбъект.Товары.Загрузить(тзТоварыДокумента);
			
			Попытка
				Если ДокументЗаказОбъект.ПроверитьЗаполнение() Тогда 
					ДокументЗаказОбъект.Записать();
				Иначе
					ДокументЗаказОбъект.Записать();
					ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Документ %1 не проведен'; uk = 'Документ %1 не проведений'"),
					ДокументЗаказОбъект.Ссылка),
					ДокументЗаказОбъект.Ссылка);
				КонецЕсли;
			Исключение                                                                  
				ДокументЗаказОбъект.Записать();
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
		СтрокаДереваДокумент.Выбор = Ложь	
		
	КонецЦикла;	
	
	Результат.Вставить("ДеревоДокументов", ДеревоДокументов);
	
	Возврат Результат;
КонецФункции


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДеревоДокументов(СтруктураДокумента, ДеревоДокументов)
	
	СтрокаДерева = ДеревоДокументов.Строки.Добавить();
	СтрокаДерева.ДокументНоменклатура = "Документ № "+ СтруктураДокумента.НомерДокумента + " от "+ Формат(СтруктураДокумента.ДатаДокумента,"ДФ=dd.MM.yyyy");
	СтрокаДерева.ДатаДокумента = ТекущаяДата();
	СтрокаДерева.ИмяФайла       = СтруктураДокумента.ИмяФайла;
	СтрокаДерева.Выбор = Истина;
	 	
	Для Каждого СтрокаТовары Из СтруктураДокумента.Товары Цикл 
		СтрокаДереваТовары = СтрокаДерева.Строки.Добавить();
		
		СтрокаДереваТовары.ДокументНоменклатура = СтрокаТовары.Номенклатура;   
		СтрокаДереваТовары.Количество = СтрокаТовары.Количество;
		СтрокаДереваТовары.Цена       = СтрокаТовары.Цена;
		СтрокаДереваТовары.СуммаВсего = СтрокаТовары.Цена * СтрокаТовары.Количество;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТоварПоКодуПоставщика(Код)
	
		Запрос=Новый Запрос("ВЫБРАТЬ
		                    |	ДополнительныеСведения.Объект КАК Номенклатура
		                    |ИЗ
		                    |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		                    |ГДЕ
		                    |	ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура
		                    |	И ДополнительныеСведения.Свойство.Имя = ""КодТедис""
		                    |	И ДополнительныеСведения.Значение = &КодТедис");
		
		Запрос.УстановитьПараметр("КодТедис",Код);
		РезультатПоиска=Запрос.Выполнить();
		
		Если РезультатПоиска.Пустой() Тогда
			Возврат Справочники.Номенклатура.ПустаяСсылка();
		Иначе
			Выборка = РезультатПоиска.Выбрать();
			Выборка.Следующий();
			Возврат Выборка.Номенклатура;
			
		КонецЕсли;
	
КонецФункции

#КонецОбласти



#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
